OpenDTEF-v1812/tutorials/compressible/rhoSimpleFoam/aerofoilNACA0012/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

Tinlet          298;

dimensions      [0 0 0 1 0 0 0];

internalField   uniform $Tinlet;

boundaryField
{
    freestream
    {
        type            inletOutlet;
        inletValue      uniform $Tinlet;
        value           $inletValue;
    }

    wall
    {
        type            zeroGradient;
    }

    #includeEtc "caseDicts/setConstraintTypes"
}

// ************************************************************************* //
